import { Flex, List, ScrollArea, Text } from "@mantine/core";

export default function ICLicenseAgreementFaContent() {
	return (
		<Flex direction="column" p="xl">
			<ScrollArea.Autosize type="hover" mah={690}>
				<Text size="sm">
					لطفا قبل از استفاده از محصول نرم افزاری کورلاگرتیس، توافقنامه ی حقوقی
					زیر را به دقت مطالعه فرمایید. این توافقنامه بین شرکت بهین راهکار و
					کاربر این نرم افزار منعقد میگردد. در توافقنامه ی پیش رو منظور از
					«شرکت» همان شرکت بهین راهکار و کاربر همان کسی است که از نرم افزار
					استفاده میکند. شما با خواندن این توافقنامه کلیه شروط و مندرجات آن را
					خواهید دید و میبایست که به مفاد و شرایط توافقنامه مقید باشید. چنانچه
					با تمام مفاد و شرایط این توافقنامه موافق نیستید، از آن استفاده
					ننمایید؛ در غیر این صورت حق استفاده از نرم افزار را با توجه به مفاد و
					محدودیتهای این توافقنامه خواهید داشت.
				</Text>
				<List type="ordered" mt="xl" w="93%">
					<List.Item>
						<Text size="md" fw="bolder">
							حقوق مالکیت
						</Text>
						<List type="ordered">
							<List.Item>
								مالکیت نرم افزار وتمامی حقوق مادی و معنوی متعلق به آن و همچنین
								منافع و مستندات آن از هر جهت متعلق به شرکت بوده ومشمول تمامی
								قوانین و مقررات حمایت از کپی رایت می باشد و نقض این حقوق باعث
								شمول واجرای ضمانت اجراهای کیفری و حقوقی مندرج در قوانین موضوعه
								خواهد شد.. نصب و استفاده شما از نرم افزار هیچ حقی در مالکیت در
								آن را برای شما به وجود نمیآورد و شما هیچ حقی در نرم افزار به جز
								آن چه صراحتا در این توافقنامه گفته شده است، ندارید.
							</List.Item>
							<List.Item mt="xs">
								شما موافقت میکنید که به هیچ وجه در این نرم افزار تغییری به وجود
								نیاورید. شما نمیتوانید هیچ قسمتی از نرم افزار اعم از برنامه،
								مستندات، پیامها و ... را تغییر داده یا حذف کنید.
								<List type="ordered">
									<List.Item>
										<Text size="md" fw="bolder">
											تبصره ۱:
										</Text>
										<Text>
											شرکت در اعمال تغییرات در ویرایش ها و نسخه های جدید کاملا
											مختار است.
										</Text>
									</List.Item>
									<List.Item>
										<Text size="md" fw="bolder">
											تبصره ۲:
										</Text>
										<Text>
											بدلیل رفع باگ های گزارش شده و همچنین تغییرات تکنولوژی،
											بهره بردار باید شخصا عرضه نسخه های جدید را پیگیری نموده و
											بطور مداوم نسبت به بروزرسانی نرم افزار به ویرایش ها و نسخه
											های جدید و همچنین تمدید پشتیبانی سالانه اقدام نماید.
										</Text>
									</List.Item>
									<List.Item>
										<Text size="md" fw="bolder">
											تبصره ۳:
										</Text>
										<Text>
											دریافت ویرایش های رایگان در زمان پشتیبانی مشمول ویرایش های
											همان نسخه می باشد و در صورت تولید محصول با نسخه جدید،
											مشمول این بروزرسانی نمی گردد.
										</Text>
									</List.Item>
								</List>
							</List.Item>
						</List>
					</List.Item>
					<List.Item mt="md">
						<Text size="md" fw="bolder">
							مقررات عمومی
						</Text>
						<List type="ordered">
							<List.Item>
								هرگونه به روزرسانی، و همچنین ارتقاء به عنوان بخشی از محصول نرم
								افزاری در نظر گرفته میشود و واجد شرایط و ضوابط کلی ذکر شده برای
								محصول در این توافقنامه است.
							</List.Item>
							<List.Item mt="xs">
								در صورتی که شما هر کدام از مفاد و شرایط این توافقنامه را نقض
								کنید، شرکت حق دارد مجوز استفاده ازی نرم افزار را لغو کند.{" "}
							</List.Item>
							<List.Item mt="xs">
								شما توافق کردید که در استفاده از این نرم افزار و یا هر گزارش و
								اطلاعاتی که به عنوان نتیجه از این نرم افزار اخذ میشود، به تمام
								قوانین و مقرارت قابل اجرای بین المللی و ملی از جمله (و نه محدود
								به( قوانین محرمانگی، مالکیت معنوی، و قوانین اخلاقی) پایبند
								باشید.
							</List.Item>
							<List.Item mt="xs">
								به غیر از مواردی که اختصاصا در این متن توضیح داده شده است، شما
								نمیتوانید هیچ کدام از حقوقی را که تحت این توافقنامه به شما اعطا
								شده است یا هر کدام از تعهداتی را که بدین وسیله شما را به آن ملزم
								کرده است به کسی منتقل یا منسوب کنید.
							</List.Item>
							<List.Item mt="xs">
								کاربر متعهد میشود که محرمانه بودن کلمه عبور و اطلاعات حساب
								کاربری خود را حفظ نماید و مسئولیت تمامی عملیاتی که به وسیله حساب
								کاربری انجام میشود به عهده خود کاربر بوده و در صورت بروز
								رخدادهای امنیتی از جمله (و نه محدود به( لو رفتن کلمه عبور، و
								استفاده غیر مجاز از حساب کاربری)، سریعا مراتب را به شرکت اطلاع
								دهد.
							</List.Item>
						</List>
					</List.Item>
					<List.Item mt="md">
						<Text size="md" fw="bolder">
							محدودیتهای استفاده
						</Text>
						<List type="ordered">
							<List.Item>
								هرگونه بهره برداری غیر مجاز و غیر قانونی، تحت هر عنوان از جمله
								(و نه محدود به( کپی کردن نرم افزار یا مستندات آن، تغییر نرم
								افزار یا سازگار کردن آن یا ملحق کردن آن به نرم افزار دیگر،
								مهندسی معکوس، دیکامپایل (تبدیل کدماشین به کد سطح بالا( ) یا
								هرگونه تلاشی برای کشف کد نرم افزار، قراردادن نرم افزار در یک
								سرور به گونه ای که از طریق شبکه های عمومی (نظیر اینترنت) یا
								وسایل ارتباطی قابل دسترسی باشد، اجاره دادن یا در معرض استفاده
								عموم قراردادن تمام یا بخشی از نرم افزار و یا توزیع نرم افزار به
								هرشکل که صورت پذیرد، ممنوع است.
							</List.Item>
							<List.Item mt="xs">
								در نرم افزار یه رول (ماشین مجازی) بنام Identity Gateway وجود
								دارد که وظیفه احراز هویت اجزای مختلف سامانه را بر عهده دارد. در
								صورتیکه هرگونه دسترسی غیرمجاز یا حتی تلاش برای دسترسی غیرمجاز به
								این رول صورت گیرد، ممکن است سامانه و لایسنس های موجود روی تمای
								اجزای آن دچار اختلال گردد و در بسیاری از مواقع این امر میتواند
								به از کار افتادن کامل نرم افزار گردد.
							</List.Item>
							<List.Item mt="xs">
								در نرم افزار هر رول (ماشین مجازی) برای عملکرد صحیح باید بتواند
								با رول Identity Gateway ارتباط شبکه ای و اپلیکیشنی لازم را
								برقرار نماید در صورتیکه هرگونه اختلال در سطح ارتباطات شبکه بین
								هر رول با Identity Gateway ایجاد شود، میتواند باعث از کار افتادن
								کامل نرم افزار شود. همچنین در صورتیکه هرگونه دسترسی غیرمجاز یا
								حتی تلاش برای دسترسی غیرمجاز به هریک از رول های نرم افزار صورت
								گیرد، میتواند منتج به از کار افتادن کامل نرم افزار شود.
							</List.Item>
							<List.Item mt="xs">
								تمامی رول های (ماشین های مجازی) نرم افزار باید از طریق Deploy
								کردن OVA مرجع ارائه شده توسط شرکت بهین راهکار، در زیرساخت مجازی
								سازمان راه اندازی شود و در صورتیکه هر روش دیگری یا حتی تلاش برای
								Deploy کردن رول از هر روش دیگری از جمله و نه محدود به (کلون
								گرفتن از ماشین های مجازی، رجیستر کردن فایل vmdk، و ...) صورت
								گیرد، این امر میتواند منتچ به از کار افتادن کامل نرم افزار و
								لایسنس آن شود.
							</List.Item>
							<List.Item mt="xs">
								در صورتیکه هر کدام از رول های (ماشین های مجازی) نرم افزار به
								واسطه هرگونه دسترسی یا تلاش برای دسترسی غیرمجاز، از کار افتاده
								باشد، تاثیر مستقیم روی لایسنس قرارداده شده روی تمامی رول های نرم
								افزار می گذارد که در این صورت دیگر امکان بازیابی لایسنس ها وجود
								نخواهد داشت و کاربر باید مجددا نسبت به خرید لایسنس نرم افزار
								اقدام نماید.
							</List.Item>
							<List.Item mt="xs">
								در صورت تخلف کاربر از مفاد این ماده و یا دیگر تعهدات ناشی از این
								توافقنامه ، وی مسئول و متعهد به جبران کلیه خسارات مادی و معنوی،
								مستقیم ویا غیر مستقیم وارده به شرکت خواهد بود.
							</List.Item>
							<List.Item mt="xs">
								نرم افزار موضوع توافقنامه حاضر محتوی اسرار تجاری و اطلاعات خاص
								شرکت میباشد و هرگونه استفاده و یا افشای اطلاعات و اسرار موصوف به
								عنوان نقض حقوق اسرار تجاری تلقی شده و قابل پیگرد خواهد بود.
							</List.Item>
							<List.Item mt="xs">
								شما نباید نرم افزار را به شخص دیگری اجاره، قرض یا کرایه بدهید.
							</List.Item>
						</List>
					</List.Item>
					<List.Item mt="md">
						<Text size="md" fw="bolder" mt="md">
							ضمانت محدود و سلب مسئولیت
						</Text>
						<List type="ordered">
							<List.Item>
								شرکت تضمین میکند که نرم افزار به طور قابل ملاحظه بر اساس مشخصات
								و توصیفاتی که در مستندات وجود دارد، کار میکند. در حالی که ضمانت
								محدود در موارد زیر به کار نمیرود (الف.) نواقص دستگاه شما و
								تخلفات مرتبط که شرکت صریحا هرگونه مسئولیت ضمانت را از خود رفع
								مسئولیت میکند (ب.) سوء عمل، نواقص، یا خرابی بر اثر استفادهی غلط،
								سوء استفاده، تصادف، غفلت، نصب، کاربری و نگهداری نامناسب، دزدی،
								خرابکاری، بلایای طبیعی، اختلال برق، سانحه، تناوب، تغییرات غیر
								مجاز، یا تعمیر توسط هر شخصی به جز افراد تعیین شده توسط شرکت، یا
								عمل خود شما یا دلایلی که از کنترل شرکت خارج است (ج.) هر خرابی که
								توسط شما بعد از اولین خرابی به وجود بیاید (د.) عدم سازگاری ایجاد
								شده توسط اجزای سخت افزار و/یا نرم افزار دستگاه شما.
							</List.Item>
							<List.Item mt="xs">
								شما میپذیرید که هیچ نرم افزاری خالی از خطا نیست و به شما توصیه
								میشود که از دستگاه خود نسخه های پشتیبان در فاصله های زمانی مناسب
								تهیه نمایید.
							</List.Item>
							<List.Item mt="xs">
								شرکت تضمین نمیکند که در صورت نقض شرایطی که آورده شده است، نرم
								افزار درست کار کند.
							</List.Item>
							<List.Item mt="xs">
								شرکت تضمین نمیکند که در صورت نقض شرایطی که آورده شده است، نرم
								افزار درست کار کند.
							</List.Item>
							<List.Item mt="xs">
								شرکت تضمین نمیکند که اگر شما به روزرسانیها و ارتقاهای مشخص شده
								این توافقنامه را مرتب انجام ندهید، نرم افزار درست کار کند.
							</List.Item>
							<List.Item mt="xs">
								شما موافقت میکنید که نرم افزار با تنظیمات استاندارد اعمال شدهی
								پیش فرض محصول میباشد و این مسئولیت شما میباشد که نرم افزار را
								برای تامین نیازمندیهای خودتان پیکربندی کنید.
							</List.Item>
							<List.Item mt="xs">
								شرکت هیچ تضمین، شرایط، ادعا و مفادی (صریحا یا تلویحا، با اساس
								نامه، قانون، عرف، کاربری یا غیره) برای هیچ موردی از جمله (و نه
								محدود به( ) عدم تخلف از حقوق شخص سوم، خرید و فروش، کیفیت مطلوب،
								شراکت یا کاربرد برای اهداف عمومی را تامین نمیکند. شما تمام
								اشتباهات و تمام ریسکهای عملکرد و انتخاب نرم افزار برای دست یابی
								به مقاصدتان، و برای نصب، استفاده و نتیجهی به دست آمده از نرم
								افزار را شخصا بر عهده میگیرید.
							</List.Item>
						</List>
					</List.Item>
					<List.Item mt="md">
						<Text size="md" fw="bolder">
							محدودیت در مسئولیت
						</Text>
						<List type="ordered">
							<List.Item>
								تا بیشترین حدی که قانون مربوطه اجازه میدهد، در هیچ شرایطی شرکت
								یا شرکایش نباید مسئول هیچ ضرری باشند، خواه این ضرر خاص، تصادفی،
								تنبیهی، غیر مستقیم و یا متعاقب و غیر از آن باشد (از جمله خسارات
								ناشی از دست دادن سود یا اطلاعات محرمانه یا اطلاعات دیگر، تعلیق
								کار، از دست دادن محرمانگی، خراب شدن، آسیب دیدگی یا از دست دادن
								دادهها یا برنامه ها، به دلیل انجام نشدن وظایفی شامل وظایف
								قانونی، وظایف اخلاقی یا وظایف نگهداری صحیح، غفلت، ضرر اقتصادی، و
								هر ضرر مالی دیگر)، و به دلیل هر روش استفاده ای مربوط به عدم
								توانایی استفاده از نرم افزار ، قانون خرابی یا پشتیبانی یا
								سرویسهای دیگر، اطلاعات، نرم افزار و موارد مربوط به نرم افزار یا
								استفاده از آن که رخ داده باشد، تحت یا مرتبط به هر قانونی با هر
								ماده ای در این قرار داد یا نقض قرارداد یا هرگونه جرم (شامل غفلت،
								ارائه ی غلط)، هر الزام مسئولیت جدی یا وظیفه( یا هر نقض قانون یا
								هر نقض ضمانت شرکت یا هر کدام از شرکایش حتی اگر به شرکت یا
								شرکایش) در مورد امکان این خرابیها هشدار داده شده باشد.nشما
								موافقت میکنید که در شرایطی که شرکت و شرکایش مسئول هستند، مسئولیت
								آنها محدود به ارزش نرم افزار میباشد. در هیچ موردی مسئولیت آنها
								از هزینه ای که برای نرم افزار به آنها پرداخته شده است تجاوز
								نمیکند.این توافقنامه از هر جهت تابع،مقررات جمهوری اسلامی ایران
								از جمله قانون حمایت ازحقوق پدیدآورندگان نرم افزارهای رایانه ای
								مصوب1379و آئین نامه اجرایی آن بوده و در صورت بروز هرگونه اختلاف
								در تفسیر و یا اجرای مفاد این توافقنامه، شورای انتظامی سازمان
								نظام صنفی رایانه ای تهران بعنوان داور مرضی الطرفین انتخاب
								میگردد.درصورت اختلاف موضوع ابتدا درکمیته رسیدگی به شکایات شرکت
								با حضور طرفین بررسی شده و در صورت عدم حصول نتیجه،به داور ارجاع
								می گردد و در صورت عدم قبول نتیجه داوری در محاکم عمومی تهران قابل
								طرح و رسیدگی خواهد بود.
							</List.Item>
						</List>
					</List.Item>
				</List>
			</ScrollArea.Autosize>
		</Flex>
	);
}
